// Задача 29. Напишите программу, которая задает массив из 8 элементов и выводит их на экран.

Console.WriteLine("Hello, World!");
